#include <stdio.h>

int main() {
    printf("=%d=\n", 123);
    printf("=%5d=\n", 123); //กำหนดความกว้างขั้นต่ำ 5 ช่อง ถ้าตัวเลขสั้นกว่าจะชิดขวาและเติมช่องว่างด้านหน้า
    printf("=%-5d=\n", 123); //เหมือนด้านบนแต่มีเครื่องหมาย - นำหน้าตัวเลขความกว้าง ทำให้ชิดซ้ายและเติมช่องว่างด้านหลังแทน
    printf("=%f=\n", 3.14); //แสดงทศนิยม โดยค่าเริ่มต้น (default) จะแสดง 6 ตำแหน่งหลังจุดทศนิยมเสมอ (เติม 0 ถ้าตัวเลขจริงมีทศนิยมน้อยกว่า)
    printf("=%.2f=\n", 3.14); //จุด (.) ตามด้วยตัวเลข คือกำหนดความละเอียดทศนิยม (precision) ว่าจะแสดงกี่ตำแหน่ง — ในที่นี้คือ 2 ตำแหน่ง
    printf("=%5.2f=\n", 3.14); //รวมทั้งความกว้างขั้นต่ำ 5 ช่อง และทศนิยม 2 ตำแหน่ง โดยจะชิดขวา
    printf("=%-5.2f=\n", 3.14); //เหมือนด้านบนแต่ชิดซ้ายแทน (เพราะมี -)

    return 0;
}