#include <stdio.h>

int main() {
    // 1. ประกาศตัวแปร name เก็บอักขระตัวแรกของชื่อเล่น (ใช้ char)
    char name = 'J';
    
    // 2. ประกาศตัวแปร age เก็บอายุเป็นเลขจำนวนเต็ม (ใช้ int)
    int age = 20;
    
    // 3. ประกาศตัวแปร weight เก็บน้าหนักเป็นเลขทศนิยม (ใช้ float)
    float weight = 55.5;

    // 4. แสดงผลทางหน้าจอ บรรทัดที่ 1 (แสดงชื่อและอายุ)
    printf("Student %c is %d years old.\n", name, age);
    
    // 4. แสดงผลทางหน้าจอ บรรทัดที่ 2 (แสดงน้ำหนัก)
    printf("His weighs is %.1f kg.\n", weight);

    return 0; // คืนค่า 0 เพื่อบอกว่าโปรแกรมทำงานเสร็จสิ้นสมบูรณ์
}